#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.foreign_language_reader must be replaced
-/+ resource "digitalocean_kubernetes_cluster" "foreign_language_reader" {
      ~ cluster_subnet = "10.244.0.0/16" -> (known after apply)
      ~ created_at     = "2020-03-15 07:58:25 +0000 UTC" -> (known after apply)
      ~ endpoint       = "https://9329c2de-f4e2-4f80-be4c-16fefb26477e.k8s.ondigitalocean.com" -> (known after apply)
      ~ id             = "9329c2de-f4e2-4f80-be4c-16fefb26477e" -> (known after apply)
      ~ ipv4_address   = "138.197.199.67" -> (known after apply)
      ~ kube_config    = (sensitive value)
        name           = "foreign-language-reader"
        region         = "sfo2"
      ~ service_subnet = "10.245.0.0/16" -> (known after apply)
      ~ status         = "running" -> (known after apply)
        tags           = [
            "prod",
        ]
      ~ updated_at     = "2020-03-22 06:00:12 +0000 UTC" -> (known after apply)
      ~ version        = "1.16.6-do.2" -> "1.16.6-do.0" # forces replacement

      ~ node_pool {
          ~ actual_node_count = 4 -> (known after apply)
            auto_scale        = true
          ~ id                = "526d45ba-e14f-437e-883e-54bcf648a21f" -> (known after apply)
          - labels            = {} -> null
            max_nodes         = 5
            min_nodes         = 1
            name              = "worker-pool"
          - node_count        = 0 -> null
          ~ nodes             = [
              - {
                  - created_at = "2020-03-21 22:17:49 +0000 UTC"
                  - droplet_id = "185707694"
                  - id         = "2ee566c0-2957-4e77-abb1-c5e9ddc8bfaa"
                  - name       = "worker-pool-ztyu"
                  - status     = "running"
                  - updated_at = "2020-03-21 22:19:09 +0000 UTC"
                },
              - {
                  - created_at = "2020-03-21 22:17:49 +0000 UTC"
                  - droplet_id = "185707693"
                  - id         = "14dd9710-576e-4ee0-8964-4aa27ae062a8"
                  - name       = "worker-pool-ztyc"
                  - status     = "running"
                  - updated_at = "2020-03-21 22:19:09 +0000 UTC"
                },
              - {
                  - created_at = "2020-03-21 22:22:19 +0000 UTC"
                  - droplet_id = "185707970"
                  - id         = "7b627b3d-ccfa-47aa-baa7-9acd70824252"
                  - name       = "worker-pool-ztyk"
                  - status     = "running"
                  - updated_at = "2020-03-21 22:23:39 +0000 UTC"
                },
              - {
                  - created_at = "2020-03-21 22:25:29 +0000 UTC"
                  - droplet_id = "185708224"
                  - id         = "61f51359-a05f-4ee0-af3d-7369aed110f0"
                  - name       = "worker-pool-ztxu"
                  - status     = "running"
                  - updated_at = "2020-03-21 22:26:50 +0000 UTC"
                },
            ] -> (known after apply)
            size              = "s-2vcpu-4gb"
          - tags              = [] -> null
        }
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_secret.refresh_definitions_elastic_credentials will be created
  + resource "kubernetes_secret" "refresh_definitions_elastic_credentials" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "refresh-definitions-elastic-credentials"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.kubernetes_config.random_password.refresh_definitions_elasticsearch_password will be created
  + resource "random_password" "refresh_definitions_elasticsearch_password" {
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 10
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.infrastructure.module.container_registries.module.content_jobs.aws_ecr_lifecycle_policy.clean_up_container_registry will be created
  + resource "aws_ecr_lifecycle_policy" "clean_up_container_registry" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Only keep the last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "foreign-language-reader-content-jobs"
    }

  # module.infrastructure.module.container_registries.module.content_jobs.aws_ecr_repository.repository will be created
  + resource "aws_ecr_repository" "repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "foreign-language-reader-content-jobs"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.infrastructure.module.container_registries.module.content_jobs.aws_iam_policy.pull_access will be created
  + resource "aws_iam_policy" "pull_access" {
      + arn         = (known after apply)
      + description = "IAM policy for pulling containers from foreign-language-reader-content-jobs"
      + id          = (known after apply)
      + name        = "foreign-language-reader-content-jobs-pull-role"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:ListTagsForResource",
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:DescribeImageScanFindings",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:us-west-2:037187302622:repository/foreign-language-reader-content-jobs"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.infrastructure.module.container_registries.module.content_jobs.aws_iam_policy.push_access will be created
  + resource "aws_iam_policy" "push_access" {
      + arn         = (known after apply)
      + description = "IAM policy for pushing containers to foreign-language-reader-content-jobs"
      + id          = (known after apply)
      + name        = "foreign-language-reader-content-jobs-push-role"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:ListTagsForResource",
                          + "ecr:ListImages",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:DescribeImageScanFindings",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:us-west-2:037187302622:repository/foreign-language-reader-content-jobs"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.infrastructure.module.container_registries.module.content_jobs.aws_iam_policy_attachment.pull_attach will be created
  + resource "aws_iam_policy_attachment" "pull_attach" {
      + id         = (known after apply)
      + name       = "foreign-language-reader-content-jobs-pull-role-attach"
      + policy_arn = (known after apply)
      + users      = [
          + "foreign-language-reader-kubernetes",
        ]
    }

  # module.infrastructure.module.container_registries.module.content_jobs.aws_iam_policy_attachment.push_attach will be created
  + resource "aws_iam_policy_attachment" "push_attach" {
      + id         = (known after apply)
      + name       = "foreign-language-reader-content-jobs-push-role-attach"
      + policy_arn = (known after apply)
      + users      = [
          + "foreign-language-reader-github",
        ]
    }

Plan: 9 to add, 0 to change, 1 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
